UNIT Stemming;
INTERFACE 

FUNCTION GetBase(ProcessingWord: STRING) : STRING;

IMPLEMENTATION
VAR
  Superlative: ARRAY[1 .. 2]  OF STRING = ('ейш', 'ейше');
  Derivation:  ARRAY[1 .. 2]  OF STRING = ('ост', 'ость');
  PerfectiveGerund: ARRAY[1 .. 12] OF STRING = (
    'ав', '€вши', 'авшись',
    '€в', '€вши', '€вшись',
    'ив', 'ивши', 'ившись',
    'ыв', 'ывши', 'ывшись'
  );

  Adjective: ARRAY[1 .. 26] OF STRING = (
    'ее',  'ие',  'ые',  'ое', 'ими', 
    'ыми', 'ей',  'ий',  'ый', 'ой', 
    'ем',  'им',  'ым',  'ом', 'его', 
    'ого', 'ему', 'ому', 'их', 'ых', 
    'ую',  'юю',  'а€',  '€€', 'ою', 
    'ею'
  );

  Participle: ARRAY[1 .. 13] OF STRING = (
    'аем', 'анн', 'авш', 'ающ', 'ащ',
    '€ем', '€нн', '€вш', '€ющ', '€щ',
    'ивш', 'ывш', 'ующ'
  );

  Verb: ARRAY[1 .. 63] OF STRING = (
    'ала',  'ана', 'аете', 'айте', 'али', 
    'ай',   'ал',  'аем',  'ан',   'ало', 
    'ано',  'ает', 'ают',  'аны',  'ать', 
    'аешь', 'анно',

    '€ла',  '€на', '€ете', '€йте', '€ли', 
    '€й',   '€л',  '€ем',  '€н',   '€ло', 
    '€но',  '€ет', '€ют',  '€ны',  '€ть', 
    '€ешь', '€нно',

    'ила', 'ыла', 'ена', 'ейте', 'уйте', 
    'ите', 'или', 'ыли', 'ей',   'уй', 
    'ил',  'ыл',  'им',  'ым',   'ен', 
    'ило', 'ыло', 'ено', '€т',   'ует', 
    'уют', 'ит',  'ыт',  'ены',  'ить', 
    'ыть', 'ишь', 'ую',  'ю'
  );

  Noun: ARRAY[1 .. 36] OF STRING = (
    'а',  'ев',   'ов',  'ие',  'ье', 
    'е',  'и€ми', '€ми', 'ами', 'еи', 
    'ии', 'и',    'ией', 'ей',  'ой', 
    'ий', 'й',    'и€м', '€м',  'ием', 
    'ем', 'ам',   'ом',  'о',   'у', 
    'ах', 'и€х',  '€х',  'ы',   'ь', 
    'ию', 'ью',   'ю',   'и€',  'ь€', 
    '€'
  );
  
  Word, RV: STRING;
  Len: INTEGER;

PROCEDURE GetRV;
BEGIN
  
END;

FUNCTION GetBase(ProcessingWord: STRING) : STRING;
BEGIN
  Word := ProcessingWord;
  Len := LENGTH(Word);  
END;

BEGIN  
END.
